In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
%matplotlib inline

from pydataset import data

<hr style="border-top: 10px groove blueviolet; margin-top: 1px; margin-bottom: 1px"></hr>

### 1.  Load the mpg dataset. Read the documentation for it, and use the data to answer these questions:

In [3]:
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

___

#### On average, which manufacturer has the best miles per gallon?

___

#### How many different manufacturers are there?

___

#### How many different models are there?

___

#### Do automatic or manual cars have better miles per gallon?

___

<hr style="border-top: 10px groove blueviolet; margin-top: 1px; margin-bottom: 1px"></hr>

### 2. Joining and Merging

- Copy the users and roles dataframes from the examples above.

In [4]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})

users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [5]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})

roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

___

#### What do you think a right join would look like?

___

#### What would an outer join look like?

___

#### What happens if you drop the foreign keys from the dataframes and try to merge them?

<hr style="border-top: 10px groove blueviolet; margin-top: 1px; margin-bottom: 1px"></hr>

### 3. Getting data from SQL databases

___

#### Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url formatted like in the examples in this lesson.

___

#### Use your function to obtain a connection to the employees database.

___

#### Once you have successfully run a query:

- Intentionally make a typo in the database url. What kind of error message do you see?

- Intentionally make an error in your SQL query. What does the error message look like?

___

#### Read the employees and titles tables into two separate dataframes.

___

#### Visualize the number of employees with each title.

___

#### Join the employees and titles dataframes together.

___

#### Visualize how frequently employees change titles.

___

#### For each title, find the hire date of the employee that was hired most recently with that title.

___

#### Write the code necessary to create a cross tabulation of the number of titles by department.

<div class="alert alert-block alert-info"><b>Hint:</b> This will involve a combination of SQL and python/pandas code.</div>

<hr style="border-top: 10px groove blueviolet; margin-top: 1px; margin-bottom: 1px"></hr>

### 4. Use your get_db_url function to help you explore the data from the chipotle database. Use the data to answer the following questions:

___

#### What is the total price for each order?

___

#### What are the most popular 3 items?

___

#### Which item has produced the most revenue?